sdaiIsKindOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether a specified application instance is a kind of a specified type.
\param instance [in] An application instance to be checked.
\param entity   [in] An entity that represents the type.
\returns sdaiTRUE if the application instance belongs to the specified type; otherwise, the function returns false.